CSI API ETABS v1
cPointObj.GetLabelNameList Method
 Retrieves the names and labels of all defined point objects.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetLabelNameList(
	ref int NumberNames,
	ref string[] MyName,
	ref string[] MyLabel,
	ref string[] MyStory
)
Function GetLabelNameList (
	ByRef NumberNames As Integer,
	ByRef MyName As String(),
	ByRef MyLabel As String(),
	ByRef MyStory As String()
) As Integer
Dim instance As cPointObj
Dim NumberNames As Integer
Dim MyName As String()
Dim MyLabel As String()
Dim MyStory As String()
Dim returnValue As Integer
returnValue = instance.GetLabelNameList(NumberNames,
	MyName, MyLabel, MyStory)
int GetLabelNameList(
	int% NumberNames,
	array<String^>^% MyName,
	array<String^>^% MyLabel,
	array<String^>^% MyStory
)
abstract GetLabelNameList :
        NumberNames : int byref *
        MyName : string[] byref *
        MyLabel : string[] byref *
        MyStory : string[] byref -> int
Parameters
NumberNames
Type: System.Int32
 The number of point object names retrieved by the program.
MyName
Type: System.String[]
 This is a one-dimensional array of point object names. The MyName array is created as a dynamic, zero-based, array by the API user:
Dim MyName() as String
 The array is dimensioned to (NumberNames – 1) inside the program, filled with the names, and returned to the API user.
MyLabel
Type: System.String[]
 This is a one-dimensional array of point object labels. The MyLabel array is created as a dynamic, zero-based, array by the API user:
Dim MyLabel() as String
 The array is dimensioned to (NumberNames – 1) inside the program, filled with the labels, and returned to the API user.
MyStory
Type: System.String[]
 This is a one-dimensional array of the story levels of the point objects. The MyStory array is created as a dynamic, zero-based, array by the API user:
Dim MyStory() as String
 The array is dimensioned to (NumberNames – 1) inside the program, filled with the story levels, and returned to the API user.
Return Value
Type: Int32
 Returns zero if the data is successfully retrieved, otherwise it returns nonzero.
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
   Dim NumberNames As Integer
   Dim MyName() As String
   Dim MyLabel() As String
   Dim MyStory() As String
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'get area object data
   ret = SapModel.PointObj.GetLabelNameList(NumberNames, MyName, MyLabel, MyStory)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cPointObj Interface
ETABSv1 Namespace